IsWorksetVisible Method
 Indicates whether the workset is visible in this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsWorksetVisible(
	WorksetId worksetId
)
Visual Basic
Public Function IsWorksetVisible ( _
	worksetId As WorksetId _
) As Boolean
Visual C++
public:
bool IsWorksetVisible(
	WorksetId^ worksetId
)
Parameters
worksetId
Type: Autodesk.Revit.DBWorksetId
 Id of the workset.
Return Value
 Whether the workset is visible.
Remarks
 It will take into account whether the workset is opened or closed.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  There is no workset with this Id in the document associated with this view.
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →